dataset_gen/Earlier_Datasets/Hole_Size_Change/CE_KH_Openfoam/Design_Point_0_copy_1/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
15984
(
0.00390625
0.0117188
0.0195312
0.0273438
0.0351563
0.0429688
0.0507812
0.0585938
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    hole
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
0.425781
0.433594
0.441406
0.449219
0.457031
0.464844
0.472656
0.480469
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
