dataset_gen/Earlier_Datasets/Hole_Size_Change/CE_KH_Openfoam/Design_Point_0_copy_1/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
15984
(
0.00390625
0.00390625
0.00390625
0.00390625
0.00390625
0.00390625
0.00390625
0.00390625
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    hole
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
0.421875
0.421875
0.421875
0.421875
0.421875
0.421875
0.421875
0.421875
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
